W6D3/rails-router/app/controllers/artworks_controller.rb

    def index
        user = User.find_by_id(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]